Repository: DkGr/mcfly-timemachine
Catalog: po/*.po
Languages: fr

source: Backup & Restore
fr: Sauvegarde & Restauration

source: Configure your computer to periodically backup your files and restore them to a choosen date and time
fr: Configurez votre sysètme afin de sauvegarder vos fichiers de façon periodique et restaurez-les à une date antérieur

source: Go back in time !
fr: Remontez dans le temps !

source: Configure your backup space.
fr: Configurez votre espace de sauvegarde

source: Choose a backup destination
fr: Choisissez une destination de sauvegarde

source: Select a storage device for your backup
fr: Selectionnez un périphérique de stockage pour votre sauvegarde

source: Select a Backup Folder
fr: Selectionnez un dossier pour votre sauvegarde

source: Cancel
fr: Annuler

source: Some settings require administrator rights to be changed
fr: La modifications de certains paramètres nécessite les droits d'administrateur

source: Backup
fr: Sauvegarder

source: Restore
fr: Restaurer

source: Enabled
fr: Activé

source: Disabled
fr: Dsactivé

source: Partially Enabled
fr: Partiellement activé

source: Backup settings
fr: Paramètres de sauvegarde

source: Your system
fr: Votre système

source: Restore settings
fr: Paramètres de restauration
